<?php

return array(
	'Студия' => 'Студия',
	'Галерея' => 'Галерея',
	'Ткани' => 'Ткани',
	'Контакты' => 'Контакты',

	'Наш каталог' => 'Наши модели',
	'Несколько слов о нас' => 'Несколько слов о нас',
	'Наши модели' => 'Наши модели',
	'Коллекция тканей' => 'Коллекция тканей',
	'Услуги' => 'Услуги',

	'Как нас найти' => 'Как нас найти?',

	'Посмотреть на карте' => 'Посмотреть на карте',

	'Наши коллекции' => 'Наши коллекции',
	'Предыдущая модель' => 'Предыдущая модель',
	'Следующая модель' => 'Следующая модель',
	'Назад к коллекции' => 'Назад к коллекции',

	'Страница' => 'Страница',
	'Коллекция' => 'Коллекция',
	'Контактная информация' => 'Контактная информация',
	'Модели' => 'Модели',
	'Главная' => 'Главная',
	'Ателье ГраНат в Николаеве' => 'Ателье ГраНат в Николаеве',
	'Все права защищены' => 'Все права защищены'
);